ninety_nine_cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
    def new
        @cats = Cat.all